#include"TFT_eSPI.h"        // ผนวกไลบรารีของชิปควบคุมจอแสดงผล LCD
TFT_eSPI tft;               // สร้างออบเจ็กต์ชื่อ tft จากคลาส TFT_eSPI สำหรับควบคุมการแสดงผล LCD
void setup() 
{
  tft.begin();              // เริ่มต้นการทำงานของจอแสดงผล LCD
  tft.setRotation(3);       // หมุนตำแหน่งการแสดงผลเป็นโหมด 3
  tft.fillScreen(TFT_RED);  // กำหนดให้แสดงสีแดงเต็มหน้าจอแสดงผล
  tft.drawRoundRect(110,70,100,100,10,TFT_BLACK); 
  // วาดรูปสี่เหลี่ยมเส้นสีดำมุมมนขนาดกว้าง 100 พิกเซล ยาว 100 พิกเซล มีรัศมีของมุมโค้งเป็น 10 พิกเซล โดยมีตำแหน่งเริ่มต้นที่ (110,70) 
}
void loop() 
{}
