#include"TFT_eSPI.h"        // ผนวกไลบรารีของชิปควบคุมจอแสดงผล LCD
TFT_eSPI tft;               // สร้างออบเจ็กต์ชื่อ tft จากคลาส TFT_eSPI สำหรับควบคุมการแสดงผล LCD
void setup() 
{
  tft.begin();              // เริ่มต้นการทำงานของจอแสดงผล LCD
  tft.setRotation(3);       // หมุนตำแหน่งการแสดงผลเป็นโหมด 3 
  tft.fillScreen(TFT_RED);  // กำหนดให้แสดงสีแดงเต็มหน้าจอแสดงผล
  tft.fillCircle(160,120,50,TFT_BLACK); // วาดวงกลมสีดำทึบที่มีจุดศูนย์กลางอยู่ที่ตำแหน่ง (160,120) รัศมี 50 พิกเซล
}
void loop() 
{}
