#include"TFT_eSPI.h"        // ผนวกไลบรารีของชิปควบคุมจอแสดงผล LCD
TFT_eSPI tft;               // สร้างออบเจ็กต์ชื่อ tft จากคลาส TFT_eSPI สำหรับควบคุมการแสดงผล LCD
void setup() 
{
  tft.begin();              // เริ่มต้นการทำงานของจอแสดงผล LCD
  tft.setRotation(3);       // หมุนตำแหน่งการแสดงผลเป็นโหมด 3 
  tft.fillScreen(TFT_RED);  // กำหนดให้แสดงสีแดงเต็มหน้าจอแสดงผล
  tft.fillTriangle(160,70,60,170,260,170,TFT_BLACK);  
  // วาดสามเหลี่ยมสีดำทึบ โดยมีมุมทั้งสามอยู่ที่พิกัด (160,70), (60,170) และ (260,170)
}
void loop() 
{}
